zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE16F16/MKE16F16.xml
        <register>
          <name>POEN</name>
          <description>Pulse-Out n Enable register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>POEN0</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POEN1</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POEN2</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POEN3</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POEN4</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POEN5</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POEN6</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POEN7</name>
              <description>PDB Pulse-Out Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POEN_0</name>
                  <description>PDB Pulse-Out disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POEN_1</name>
                  <description>PDB Pulse-Out enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PODLY</name>
          <description>Pulse-Out n Delay register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY2</name>
              <description>PDB Pulse-Out Delay 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY1</name>
              <description>PDB Pulse-Out Delay 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
