zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE16F16/MKE16F16.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA2</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA3</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA4</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA5</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA6</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA7</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA8</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA9</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA10</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA11</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DMA12</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>DMA13</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DMA14</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA15</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>DMA_Error</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>MCM</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>FTFE</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>Read_Collision</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>LVD_LVW</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>Doublebit_Fault</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>WDOG_EWM</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>LPI2C1</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>LPSPI0</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>PWT</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>LPUART0_TX</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPUART0_RX</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>LPUART1_TX</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>LPUART1_RX</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>LPUART2_TX</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>LPUART2_RX</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>CMP1</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>FTM0</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>FTM1</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>FTM2</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>RTC_Seconds</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch0</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch1</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch2</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>LPIT0_Ch3</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>PDB0</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>DAC0</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>SCG_RCM</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>LPTMR0</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>PORTA</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>PORTB</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>PORTC</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>PORTD</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>PORTE</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>SWI</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>PDB1</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>CMP2</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>FTM3</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>ADC2</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>PDB2</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>CAN0_ORed</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>CAN0_Error</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>CAN0_Wake_Up</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>CAN0_ORed_Message_buffer</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>CAN0_Reserved1</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>CAN0_Reserved2</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>CAN0_Reserved3</name>
        <value>84</value>
      </interrupt>
      <registers>
        <register>
          <name>NVICISER0</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER1</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER2</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISER3</name>
          <description>Interrupt Set Enable Register n</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA</name>
              <description>Interrupt set enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER0</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER1</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER2</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICER3</name>
          <description>Interrupt Clear Enable Register n</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRENA</name>
              <description>Interrupt clear-enable bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR0</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR1</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR2</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICISPR3</name>
          <description>Interrupt Set Pending Register n</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND</name>
              <description>Interrupt set-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR0</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR1</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR2</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICICPR3</name>
          <description>Interrupt Clear Pending Register n</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLRPEND</name>
              <description>Interrupt clear-pending bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIABR0</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIABR1</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIABR2</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIABR3</name>
          <description>Interrupt Active bit Register n</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Interrupt active flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP0</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x300</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI0</name>
              <description>Priority of interrupt 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP1</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x301</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI1</name>
              <description>Priority of interrupt 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP2</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x302</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI2</name>
              <description>Priority of interrupt 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP3</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x303</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI3</name>
              <description>Priority of interrupt 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP4</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x304</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI4</name>
              <description>Priority of interrupt 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP5</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x305</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI5</name>
              <description>Priority of interrupt 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NVICIP6</name>
          <description>Interrupt Priority Register n</description>
          <addressOffset>0x306</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PRI6</name>
              <description>Priority of interrupt 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
