zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKE16F16/MKE16F16.xml
        <register>
          <name>DEMCR</name>
          <description>Debug Exception and Monitor Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VC_CORERESET</name>
              <description>VC_CORERESET bit. Enable Reset Vector Catch. This causes a Local reset to halt a running system.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_CORERESET_0</name>
                  <description>Reset Vector Catch disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_CORERESET_1</name>
                  <description>Reset Vector Catch enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VC_MMERR</name>
              <description>VC_MMERR bit. Enable halting debug trap on a MemManage exception.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_MMERR_0</name>
                  <description>Halting debug trap disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_MMERR_1</name>
                  <description>Halting debug trap enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VC_NOCPERR</name>
              <description>VC_NOCPERR bit. Enable halting debug trap on a UsageFault caused by an access to a Coprocessor.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_NOCPERR_0</name>
                  <description>Halting debug trap disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_NOCPERR_1</name>
                  <description>Halting debug trap enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VC_CHKERR</name>
              <description>VC_CHKERR bit. Enable halting debug trap on a UsageFault exception caused by a checking error, for example an alignment check error.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_CHKERR_0</name>
                  <description>Halting debug trap disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_CHKERR_1</name>
                  <description>Halting debug trap enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VC_STATERR</name>
              <description>VC_STATERR bit. Enable halting debug trap on a UsageFault exception caused by a state information error, for example an Undefined Instruction exception.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_STATERR_0</name>
                  <description>Halting debug trap disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_STATERR_1</name>
                  <description>Halting debug trap enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VC_BUSERR</name>
              <description>VC_BUSERR bit. Enable halting debug trap on a BusFault exception.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_BUSERR_0</name>
                  <description>Halting debug trap disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_BUSERR_1</name>
                  <description>Halting debug trap enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VC_INTERR</name>
              <description>VC_INTERR bit. Enable halting debug trap on a fault occurring during exception entry or exception return.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_INTERR_0</name>
                  <description>Halting debug trap disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_INTERR_1</name>
                  <description>Halting debug trap enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VC_HARDERR</name>
              <description>VC_HARDERR bit. Enable halting debug trap on a HardFault exception.If DHCSR.C_DEBUGEN is set to 0, the processor ignores the value of this bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VC_HARDERR_0</name>
                  <description>Halting debug trap disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VC_HARDERR_1</name>
                  <description>Halting debug trap enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MON_EN</name>
              <description>MON_EN bit. Enable the DebugMonitor exception.If DHCSR.C_DEBUGEN is set to 1, the processor ignores the value of this bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MON_EN_0</name>
                  <description>DebugMonitor exception disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MON_EN_1</name>
                  <description>DebugMonitor exception enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MON_PEND</name>
              <description>MON_PEND bit. Sets or clears the pending state of the DebugMonitor exception.When the DebugMonitor exception is pending it becomes active subject to the exception priority rules. A debugger can use this bit to wakeup the monitor using the DAP.The effect of setting this bit to 1 is not affected by the value of the MON_EN bit.A debugger can set MON_PEND to 1, and force the processor to take a DebugMonitor exception, even when MON_EN is set to 0.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MON_PEND_0</name>
                  <description>Clear the status of the DebugMonitor exception to not pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MON_PEND_1</name>
                  <description>Set the status of the DebugMonitor exception to pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MON_STEP</name>
              <description>MON_STEP bit. When MON_EN is set to 0, this feature is disabled and the processor ignores MON_STEP.When MON_EN is set to 1, the meaning of MON_STEP is:0 = Do not step the processor.1 = Step the processor.Setting this bit to 1 makes the step request pending. The request becomes active when the processor returns from the DebugMonitor handler to the code being debugged. The effect of setting this bit to 1 is UNPREDICTABLE if the code being debugged is executing at an execution priority that is lower than the priority of the DebugMonitor exception.This is the debug monitor equivalent of DHCSR.C_STEP in Debug state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MON_STEP_0</name>
                  <description>Do not step the processor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MON_STEP_1</name>
                  <description>Step the processor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MON_REQ</name>
              <description>DebugMonitor semaphore bit. The processor does not use this bit. The monitor software defines the meaning and use of this bit.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRCENA</name>
              <description>TRCENA bit. Global enable for all DWT and ITM features.If the DWT and ITM blocks are not implemented, this bit is UNK/SBZP.When TRCENA is set to 0:- DWT registers return UNKNOWN values on reads. Whether the processor ignores writes to the DWT unit is IMPLEMENTATION DEFINED.- ITM registers return UNKNOWN values on reads. Whether the processor ignores writes to the ITM unit is IMPLEMENTATION DEFINED.Setting this bit to 0 might not stop all events. To ensure all events are stopped, software must set all DWT and ITM feature enable bits to 0, and then set this bit to 0.The effect of this bit on the TPIU, ETM, and other system trace components is IMPLEMENTATION DEFINED.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRCENA_0</name>
                  <description>DWT and ITM blocks disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRCENA_1</name>
                  <description>DWT and ITM blocks enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
